using System;

namespace DZ_2._6
{
    class Program
    {
        static void Main(string[] args)
        {
            //Написать программу подсчета количества «хороших» чисел в диапазоне от 1 до 1 000 000 000.//
            //«Хорошим» называется число, которое делится на ​сумму своих цифр​.//
            //Реализовать подсчёт времени выполнения программы, используя структуру DateTime.//
            double max = 1000000000;
            for (double i = 10; i <= max; i++)
            {
                double z = 0;
            }
        }
    }
}
